In [1]:
#Checking for hypothesis 4 - 
# is there a higher proportion of male unemployment (aged 16 and over) 
# in London compared to the rest of UK?

# 1. We have quarterly data from 2009 to 2019 for males and females
# in London and the rest of UK.

# 2. Using this data, we will check the level of male unemployment
# in four quarters of a particular year(2016) relative to quarters of 
# previous years (2011-'15)

# 3.H0 = There is no change in male unemployment levels between 2011-'15 and
# 2016
#  H1 = Male Unemployment has increased / decreased between 2011-'15 and 2016


# Importing necessary directories

import pandas as pd
import numpy as np
import requests
import json

In [8]:
#Importing the .xls file selecting the sheet with gender-related data

gender_data = pd.read_excel('unemployment-equalities-group.xls', sheet_name='Sex')

In [9]:
gender_data.head()

,By Sex,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,16+ unemployment rate,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Male,NaN,NaN,NaN,Female,NaN,NaN,NaN
2,NaN,London,NaN,United Kingdom,NaN,London,NaN,United Kingdom,NaN
3,12 months ending,Number,Rate,Number,Rate,Number,Rate,Number,Rate
4,2009-03-01 00:00:00,164900,7.3,1126300,6.7,139000,7.6,797200,5.5

In [117]:
#Simplifying the nomenclature of columns 
#dropping female data 

df.rename({'By Sex' : 'Date', 
           'Unnamed: 1' : 'No. of unemployed in London',
           'Unnamed: 2' : 'Rate of unemployment in London',
           'Unnamed: 3' : 'No. of unemployed in UK', 
           'Unnamed: 4' : 'Rate of unemployment in UK'}, axis = 1, inplace = True)

df.iloc[:, [0,1,2,3,4]].head()

,Date,No. of unemployed in London,Rate of unemployment in London,No. of unemployed in UK,Rate of unemployment in UK
4,2009-03-01 00:00:00,164900,7.3,1126300,6.7
5,2009-06-01 00:00:00,182100,8.1,1261800,7.5
6,2009-09-01 00:00:00,186100,8.2,1377900,8.2
7,2009-12-01 00:00:00,204700,9,1441600,8.5
8,2010-03-01 00:00:00,210100,9.2,1490300,8.8

In [118]:
#Checking statistics 

df['No. of unemployed in London'].mean()

189580.0

In [119]:
df['No. of unemployed in UK'].mean()

1339580.0

In [120]:
df['No. of unemployed in London'].median()

186100.0

In [121]:
df['No. of unemployed in UK'].median()

1377900.0

In [122]:
df['Rate of unemployment in London'].median()

8.2

In [123]:
df['Rate of unemployment in UK'].mean()

7.94